export interface Article {
  id: number
  title: string
  body: string
}

export const articles: Article[] = [
  {
    id: 1,
    title: '野球部の思い出',
    body: `3年間野球部で頑張って様々に成長し、楽しくワクワクする体験がたくさんできたことが貴重な体験になりました。練習の前にFくんとティーバッティングを毎日したのが1番楽しかったです。ヒットを打ったことよりもFくんと練習した時間が楽しかったです。トスボールがきちんとできているのに、うまく打てないと、ボールが悪いと、相手のせいにしあっていたのが良い思い出です。

あとピッチャーで試合にたくさん出れたことが良い思い出です。自分は少年野球をしていなかったので、少年野球をやっていてうまいと言われていた人や他の学校の上手い選手が自分の投げるたまに真剣に向き合っているのを感じてワクワクしました。あと遠投も74メーター飛ばしてチームで2になり、少年野球やっていたメンバーに勝ったのも嬉しかったです。。

3年の途中で辞めたのは、毎週試合に1軍で出れるか不安になりながら1週間過ごすのがしんどかったからです。嫌いで尊敬してない顧問の人に自分の心を遊ばれてるように感じました。レギュラーの人は6人ぐらいと決まっていて、自分や他の3人ぐらいは自分と同じ感じで出れたり出れなかったりするので嫌な気持ちだったんじゃないかと思います。いつも出れる人と出れるかわからない人がいて不平等だと感じました。嫌な思い出になりました。

ストレスが溜まっていたので、嫌いなメンバーを部活に来れないようにからかったり嫌がらせをしました。彼は退部しました。自分は彼から見たら本当に嫌なやつで死んでほしいと思っていたかと思います。謝っても許してくれないと思いますが、ここに自分の悪意を記憶したいと思います。こういう悪事は全部自分に返ってくると思います。いつか償いをしたいと思っています。

部活の顧問は最悪のやつでした。野球は素人なのに怒鳴り、威張る。不良や怖い先生には媚びへつらう。こいつが何も技術を教えてくれないから、自分で人の技術を学ぶしかありませんでした。守備でエラーをすると異常に怒鳴ってきました。皆の前で僕のエラーのシーンを再現してからかってきました。何も技術を教えられないくせに、批判だけする最悪なやつでした。

しかし、チームは最後の大会で3回勝ったそうです。大体1回戦で負けていたので凄いと思いました。最初は1学年30人ぐらいいたメンバーは最後の試合は11人ぐらいだったらしいので、レギュラー以外は誰も応援に行かなかったみたいです。ざまあと思っていたのですが、3回も勝ったと知って嫌な気持ちになりました。彼らは彼らでいろいろな考えて頑張ったんだと思いました。悔しいけどおめでとうと言いたいです。ベスト16おめでとう。

あと、サッカー部は小学校のクラブチームで超うまい奴がいっぱいいて、小学校は超強かったのに、中学では顧問が全く何もせず、メンバーはミニゲームばかりしていて超弱くなってました。野球部の顧問はクソでしたが、休日に活動したりして大変ではあったのだと思いましたと。あと彼は野球は素人で何も技術を教えられない劣等感を持ってやっていたんのかもしれません。今でも許せない阿呆野郎ですが、ヤツなりに頑張っていたことが記録しておいても良いでしょう。`,
  },
  {
    id: 2,
    title: '大学受験',
    body: `よくわからないが、我が家では東大やら慶応やら医学部やらとかに行くことが無条件で正しいこととされていました。何のためにその大学に行くのか？勉強するのかよくわかりませんでしたが、それを聞く事は許されない空気だったので何も聞きませんでした。
    
    大学の勉強までやる気はせず、Cばかりでした。親が望む難関有名大学に入ったのですが、偏差値がとても高かったので、低い大学の人を見下しました。でも女の子にはモテなくて悩みました。授業はクソでしたが、アセンブラで作ったゲームだけは面白かったです。しかし成績はBでした。あの大学は頭の良い人が本当に多くて、自分が行くべき大学ではなかったと思います。私はもう1ランクしたで良かったと思います。安心して生きられた気がします。しかし、私の親はそれを許さなかったと思います。

    良い大学に受かって人を見下しているうちにどんどん追い抜かれてきました。自分はアセンブラでゲームを作った時が1番楽しかったのですが、それより社会や他人が私に求めるやりたくもないことを優先して生きていました。今思えばそれが何なのかもよくわからないのですが、結果的に私は自分の思いを本当の思いを大切にして生きていませんでした。

    親は塾と進学校と有名大学に行くように何度も何度も洗脳してきました。不愉快でイライラしてすごく嫌な奴として生きてきました。陰口や皮肉ばかり言っていました。自由そうに生きている人を見をして距離を取りました。殺意が芽生えたこともありました。アウトローを気取っていましたが、すごく体制に縛られて、人の目ばかり気にしていました。

    人生のエネルギーのかなりの部分を大学受験のために使いました。自分がやりたいと心から思っていないことに、人生のエネルギーの大半を使ったので、これは自分にとってかなり大きなマイナスになりました。私が育った家の人は皆がやりたいことを我慢して生きていました。だからやりたいことをしてる人ねたんでました。父は左遷されやりたいことができなかったので、妻や子供がやりたいことをやるのは許せなかったんでしょう。

    我が家は偏差値の高い大学に行けば救われると本気で信じていました。宗教的信念と言ってもいいでしょう。私もかなり洗脳されてます。早く洗脳から解かれたいものです。

    1つだけ良かったのは日本で1番偏差値が高く有名な大学、慶應義塾大学へ行ったことで、自分は人より優れていると言う自信が持てたことです。この自信は人を見下す要因にもない私を嫌な奴としましたが、私自身が生きていく上での自信を与えてくれた気がします。なので、単純に良い悪いと結論付けることはできないような気がしています。

    ピアノを子供に強要する親、剣道を強要する親、宗教を強要する親、その当人は良かれと思ってやっているのでしょう。でもそれは子供には押し付けでしかなく、苦しみを産むものでしかない可能性もあります。私は洗脳されてしまった子供たちに伝えたい、それをしなくても、生きていけますよと。


    `,
  },
  {
    id: 3,
    title: '暗い人',
    body: `僕は明るい人が苦手です。明るい人は馬鹿なんじゃないかと思っています。僕は暗い人とか怖い人と言われることがよくあります。母はお前はため息ばかりついている、生まれた時からため息をついていたと言っていました。大学の部活でも女の人から暗いと言われました。死ぬほど嫌な奴だと思いました。ああいうキャピキャピした女の人には近寄らないほうがいいと思いました。

    キングダムと言う漫画でも、主人公の信は全然好きじゃないです。それよりも政や羌瘣、蒙武何かが好きです。るろうに剣心でも、剣心よりも左之助や斎藤一が好きです。真っ直ぐな人を見ると胡散臭いと感じます。

    最近藤子不二雄の、異色短編集や、SF短編集を読んでいます。ブラックな話が多いのでとても面白いです。子供たちもマニアックな動画を見ています。僕に似たのかと思います。子供がサッカーをやらなくてほんとに良かったと思いました。

    何故かと考えると、多分ニッチでいたいんだと思います。でもその割には有名大学や大企業に行かないといけないと思っていました。それは多分自己否定だったんだと思います。心のどこかには普通になりたいと言う思いや、明るい人への憧れで妬みがすごいあると思います。でもそれを素直に表に出さないで斜に構えています。

    私は人といるととても疲れます。ASDの傾向がすごくあると思います。人の目を過剰に気にして過剰適応して生きている気がします。

    私は自分が本来あるべき姿に戻っていくべきなんだろうと考えています。有名じゃなくてもいいし、小さい会社でもいいし、弱くても良い。本当に自分がやりたいと思えることをやって自分を大切にしていきたい。今は心からそう思っています。その時初めて人に対しても優しくなれる気がします。

 　　　`,
  },
  //   {
  //     id: 4,
  //     title: 'タイトルを入力',
  //     body: `ここに文章を書いてください。

  // 改行を入れると段落が分かれます。

  // 日々考えていること、感じたこと、記憶の断片を、言葉にしていきます。`,
  //   },
  //   {
  //     id: 5,
  //     title: 'タイトルを入力',
  //     body: `ここに文章を書いてください。

  // 改行を入れると段落が分かれます。

  // 日々考えていること、感じたこと、記憶の断片を、言葉にしていきます。`,
  //   },
  //   {
  //     id: 6,
  //     title: 'タイトルを入力',
  //     body: `ここに文章を書いてください。

  // 改行を入れると段落が分かれます。

  // 日々考えていること、感じたこと、記憶の断片を、言葉にしていきます。`,
  //   },
  //   {
  //     id: 7,
  //     title: 'タイトルを入力',
  //     body: `ここに文章を書いてください。

  // 改行を入れると段落が分かれます。

  // 日々考えていること、感じたこと、記憶の断片を、言葉にしていきます。`,
  //   },
  //   {
  //     id: 8,
  //     title: 'タイトルを入力',
  //     body: `ここに文章を書いてください。

  // 改行を入れると段落が分かれます。

  // 日々考えていること、感じたこと、記憶の断片を、言葉にしていきます。`,
  //   },
  //   {
  //     id: 9,
  //     title: 'タイトルを入力',
  //     body: `ここに文章を書いてください。

  // 改行を入れると段落が分かれます。

  // 日々考えていること、感じたこと、記憶の断片を、言葉にしていきます。`,
  //   },
  //   {
  //     id: 10,
  //     title: 'タイトルを入力',
  //     body: `ここに文章を書いてください。

  // 改行を入れると段落が分かれます。

  // 日々考えていること、感じたこと、記憶の断片を、言葉にしていきます。`,
  //   },
  //   {
  //     id: 12,
  //     title: 'タイトルを入力',
  //     body: `ここに文章を書いてください。

  // 改行を入れると段落が分かれます。

  // 日々考えていること、感じたこと、記憶の断片を、言葉にしていきます。`,
  //   },
  //   {
  //     id: 13,
  //     title: 'タイトルを入力',
  //     body: `ここに文章を書いてください。

  // 改行を入れると段落が分かれます。

  // 日々考えていること、感じたこと、記憶の断片を、言葉にしていきます。`,
  //   },
]

export function getArticle(id: number): Article | undefined {
  return articles.find((a) => a.id === id)
}
